perf-testing/experiments/gateway-direct/results.log

Summary:
  Total:	1.0884 secs
  Slowest:	0.1813 secs
  Fastest:	0.0409 secs
  Average:	0.0523 secs
  Requests/sec:	918.8170
  
  Total data:	14000 bytes
  Size/request:	14 bytes

Response time histogram:
  0.041 [1]	|
  0.055 [927]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.069 [22]	|■
  0.083 [0]	|
  0.097 [0]	|
  0.111 [0]	|
  0.125 [0]	|
  0.139 [0]	|
  0.153 [9]	|
  0.167 [30]	|■
  0.181 [11]	|


Latency distribution:
  10% in 0.0432 secs
  25% in 0.0447 secs
  50% in 0.0465 secs
  75% in 0.0481 secs
  90% in 0.0501 secs
  95% in 0.1418 secs
  99% in 0.1701 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0058 secs, 0.0409 secs, 0.1813 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0005 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0016 secs
  resp wait:	0.0463 secs, 0.0409 secs, 0.0632 secs
  resp read:	0.0001 secs, 0.0000 secs, 0.0036 secs

Status code distribution:
  [200]	1000 responses